package ru.pavel.javaprofessional;

//Сформировать таблицу товаров (id, prodid, title, cost) запросом из Java-приложения:
//        id – порядковый номер записи, первичный ключ;
//        prodid – уникальный номер товара;
//        title – название товара;
//        cost – стоимость.
//
//        При запуске приложения очистить таблицу и заполнить 10000 товаров вида:
//        id_товара 1 товар1 10
//        id_товара 2 товар2 20
//        id_товара 3 товар3 30
//        id_товара 10000 товар10000 100000
//
//        Написать консольное приложение, которое позволяет узнать цену товара по его имени, либо
//        вывести сообщение «Такого товара нет», если товар не обнаружен в базе. Консольная
//        команда: «цена товар545».
//
//        Добавить возможность изменения цены товара. Указываем имя товара и новую цену.
//        Консольная команда: «сменитьцену товар10 10000».
//
//        Вывести товары в заданном ценовом диапазоне. Консольная команда: «товарыпоцене 100
//        600»

public class App 
{
    public static void main( String[] args )
    {

    }
}
